# Задайте список из вещественных чисел. Напишите программу, которая найдёт
# разницу между максимальным и минимальным значением дробной части элементов.
#
# *Пример:*
#
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

x = [1.1, 1.2, 3.1, 5, 10.01]
var = []
for i in range(len(x)):
    if x[i] % 1 != 0:
        var.append(x[i])
x2 = [round(var[i] % 1, 2) for i in range(len(var))]
print(f"{x2} => {max(x2) - min(x2)}")
